src/main/test/supply-chain/3-Calculation/0-Apply Tax/1-GrossPriceCalc/2-TC02.02.03_09_GrossAmount_and_ItemGrossAmount/1-ST_PTE_TC02.02.03_09_FixedPrice_and_ItemGrossAmount_2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <arg0>
				        <DocumentId>
					          <SystemSourceId>ICI001</SystemSourceId>
					          <TransactionId/>
				        </DocumentId>
				        <AlternateDocumentId>
					          <CustomField1>TEST</CustomField1>
					          <CustomField2/>
					          <CustomField3/>
					          <CustomField4/>
					          <CustomField5/>
					          <CustomField6/>
					          <CustomField7/>
					          <CustomField8/>
					          <CustomField9/>
					          <CustomField10/>
				        </AlternateDocumentId>
				        <InvoiceLanguage>
					          <LanguageCode/>
					          <LanguageCountryCode/>
				        </InvoiceLanguage>
				        <CommunicationLanguage>
					          <LanguageCode/>
					          <LanguageCountryCode/>
				        </CommunicationLanguage>
				
				        <PriceType>fixed</PriceType>
            <CalculationDecimalPlaces/>
				        <PreviousInvoiceTaxCountry/>
				        <TaxDecisionSet>
					          <TaxDecisionSetId/>
					          <SellerTaxIndicator>
						            <TaxIndicatorAbbreviation/>
						            <TaxIndicatorName/>
						            <TaxIndicatorComment/>
					          </SellerTaxIndicator>
					          <SellerTaxCountry/>
					          <SellerTaxState/>
					          <BuyerTaxIndicator>
						            <TaxIndicatorAbbreviation/>
						            <TaxIndicatorName/>
						            <TaxIndicatorComment/>
					          </BuyerTaxIndicator>
					          <BuyerTaxCountry/>
					          <BuyerTaxState/>
					          <CombinedTaxIndicator/>
					          <CommercialIndicator/>
					          <SellerTaxRegCountry/>
					          <SellerTaxRegState/>
					          <BuyerTaxRegCountry/>
					          <BuyerTaxRegState/>
					          <GrossPriceCountry>DE</GrossPriceCountry>
					          <TaxComment>
						            <TaxCommentType/>
						            <TaxCommentText/>
					          </TaxComment>
					          <InvoiceCurrency>
						            <CurrencyCode>EUR</CurrencyCode>
						            <SellerLocalTaxCurrencyCode/>
						            <BuyerLocalTaxCurrencyCode/>
					          </InvoiceCurrency>
					          <LegalTaxCalculationLevel/>
					          <TaxInvoiceLine>
						            <LineNumber>1</LineNumber>
						            <ItemNo>56000000</ItemNo>
						            <ItemType/>
						            <UNSPSC>56000000</UNSPSC>
						            <Classification/>
						            <SubClassification/>
						            <CountryItemClassification/>

			               <ItemGrossAmount>53.50</ItemGrossAmount>
						            <Quantity>1</Quantity>
						            <VariableTaxSteeringInput>
							              <ConsignorCountry/>
							              <ConsignorState/>
							              <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
							              <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
							              <ConsigneeCountry/>
							              <ConsigneeState/>
							              <ConsigneeBusinessUnitCode>119</ConsigneeBusinessUnitCode>
							              <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
							              <CarrierCountry/>
							              <CarrierState/>
							              <CarrierBusinessUnitCode/>
							              <CarrierBusinessUnitType/>
							              <ShipmentStartCountry/>
							              <ShipmentEndCountry/>
							              <ShipmentStartState/>
							              <ShipmentEndState/>
							              <ServiceRenderedCountry/>
							              <ServiceRenderedState/>
							              <ResalePurpose/>
							              <IsOutBonded/>
							              <IsInBonded/>
							              <TaxPreAlgorithmOutput>
								                <IsExport/>
								                <IsImport/>
								                <IsExported/>
								                <IsImported/>
							              </TaxPreAlgorithmOutput>
							              <ShippingOfCustomsClearedGoods/>
						            </VariableTaxSteeringInput>
					          </TaxInvoiceLine>
					          <TaxInvoiceLine>
						            <LineNumber>2</LineNumber>
						            <ItemNo>10000000</ItemNo>
						            <ItemType/>
						            <UNSPSC>10000000</UNSPSC>
						            <Classification/>
						            <SubClassification/>
						            <CountryItemClassification/>
						            <ItemGrossAmount>61.80</ItemGrossAmount>
			               <Quantity>1</Quantity>
						            <VariableTaxSteeringInput>
							              <ConsignorCountry/>
							              <ConsignorState/>
							              <ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
							              <ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
							              <ConsigneeCountry/>
							              <ConsigneeState/>
							              <ConsigneeBusinessUnitCode>119</ConsigneeBusinessUnitCode>
							              <ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
							              <CarrierCountry/>
							              <CarrierState/>
							              <CarrierBusinessUnitCode/>
							              <CarrierBusinessUnitType/>
							              <ShipmentStartCountry/>
							              <ShipmentEndCountry/>
							              <ShipmentStartState/>
							              <ShipmentEndState/>
							              <ServiceRenderedCountry/>
							              <ServiceRenderedState/>
							              <ResalePurpose/>
							              <IsOutBonded/>
							              <IsInBonded/>
							              <TaxPreAlgorithmOutput>
								                <IsExport/>
								                <IsImport/>
								                <IsExported/>
								                <IsImported/>
							              </TaxPreAlgorithmOutput>
							              <ShippingOfCustomsClearedGoods/>
						            </VariableTaxSteeringInput>
					          </TaxInvoiceLine>
				        </TaxDecisionSet>
				        <TaxDate>
					          <TaxAlgorithmDate>2013-01-01</TaxAlgorithmDate>
					          <TaxCalculationDate/>
				        </TaxDate>
				        <TaxModuleBehaviour>
					          <SkipCalculation>N</SkipCalculation>
					          <SkipDecision>N</SkipDecision>
				        </TaxModuleBehaviour>
				        <VariableTaxSteeringInput>
					          <ConsignorCountry/>
					          <ConsignorState/>
					          <ConsignorBusinessUnitCode/>
					          <ConsignorBusinessUnitType/>
					          <ConsigneeCountry/>
					          <ConsigneeState/>
					          <ConsigneeBusinessUnitCode/>
					          <ConsigneeBusinessUnitType/>
					          <CarrierCountry/>
					          <CarrierState/>
					          <CarrierBusinessUnitCode/>
					          <CarrierBusinessUnitType/>
					          <ShipmentStartCountry/>
					          <ShipmentEndCountry/>
					          <ShipmentStartState/>
					          <ShipmentEndState/>
					          <ServiceRenderedCountry/>
					          <ServiceRenderedState/>
					          <ResalePurpose>Y</ResalePurpose>
					          <IsOutBonded>N</IsOutBonded>
					          <IsInBonded>N</IsInBonded>
					          <TaxPreAlgorithmOutput>
						            <IsExport>N</IsExport>
						            <IsImport>Y</IsImport>
						            <IsExported>N</IsExported>
						            <IsImported>Y</IsImported>
					          </TaxPreAlgorithmOutput>
					          <ShippingOfCustomsClearedGoods/>
				        </VariableTaxSteeringInput>
				        <BuyerParty>
					          <Party>
						            <BusinessUnitCode>1206</BusinessUnitCode>
						            <BusinessUnitType>COM</BusinessUnitType>
						            <BusinessUnitName/>
						            <PartyAddress>
							              <AddressType/>
							              <City/>
							              <PostBox/>
							              <Street/>
							              <ZipCode/>
							              <CountryCode>DE</CountryCode>
							              <StateCode/>
							              <CountryOfLegalRegistration/>
						            </PartyAddress>
					          </Party>
					          <CustomerID/>
				        </BuyerParty>
				        <SellerParty>
					          <Party>
						            <BusinessUnitCode>5100</BusinessUnitCode>
						            <BusinessUnitType>COM</BusinessUnitType>
						            <BusinessUnitName/>
						            <PartyAddress>
							              <AddressType/>
							              <City/>
							              <PostBox/>
							              <Street/>
							              <ZipCode/>
							              <CountryCode/>
							              <StateCode/>
							              <CountryOfLegalRegistration/>
						            </PartyAddress>
					          </Party>
				        </SellerParty>
				        <TermOfDelivery/>
         </arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>